{
  "title": "Patch",
  "type": "array",
  "items": {
    "$ref": "patch-operation.v1.json"
  },
  "description": "Patch is a format for describing changes to a JSON document. It can be used to avoid sending a whole document when only a part has changed. JSON Patch is actually a pretty common practice, which is specified in [RFC 6902](http://tools.ietf.org/html/rfc6902) from the IETF.\n\nEvery Patch is defined as an array of patch operations. The `path` attribute of every operation in the array specifies certain part of the target object (JSON document) to operate on. The `op` attribute specifies the exact operation to be applied to the target element. The operations are applied in the order they are provided. If any of them fail then the whole patch operation should abort.\n\n### Operations\n\nHere are all the patch operations supported.\n\n|*Status*|*Description*|\n|---|---|\n|**add**|Adds a value to an object or inserts it into an array. In the case of an array, the value is inserted before the given index. The `-` character can be used instead of an index to insert at the end of an array.|\n|**remove**|Removes a value from an object or array.|\n|**replace**|Replaces a value. Equivalent to a *remove* followed by an *add*.|\n|**copy**|Copies a value from one location to another within the JSON document. Both `from` and `path` are JSON Pointers.|\n|**move**|Moves a value from one location to the other. Both `from` and `path` are JSON Pointers.|\n|**test**|Tests that the specified value is set in the document. If the test fails, then the patch as a whole should not apply.|\n\n### JSON Pointer\n\nJSON Pointer ([IETF RFC 6901](http://tools.ietf.org/html/rfc6901)) defines a string format for identifying a specific value within a JSON document.\n\nA JSON Pointer is a string of tokens separated by `/` characters, these tokens either specify keys in objects or indexes into arrays. For example, given the JSON:\n\n```\n{\n  \"biscuits\": [  \n    { \"name\": \"Digestive\" },  \n    { \"name\": \"Choco Leibniz\" }  \n  ]  \n}\n```\n\n`/biscuits` would point to the array of biscuits and `/biscuits/1/name` would point to `\"Choco Leibniz\"`.\n\nTo point to the root of the document use an empty string for the pointer. The pointer / doesn’t point to the root, it points to a key of \"\" on the root (which is totally valid in JSON).\n\nFinally, if you need to refer to the end of an array you can use `-` instead of an index. For example, to refer to the end of the array of biscuits above you would use `/biscuits/-`. This is useful when you need to insert a value at the end of an array.\n\nFor more information about JSON Patch please refer to [http://jsonpatch.com/](http://jsonpatch.com/)."
}